---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.RevitLink
source: html/0010ac27-ce75-aae5-af64-0f58a6411109.htm
---
# Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.RevitLink Property

An external resource type representing Revit Links data.

## Syntax (C#)
```csharp
public static ExternalResourceType RevitLink { get; }
```